Table of Contents
 Class Stirrup
Namespace
IdeaRS.OpenModel.CrossSection
Assembly
IdeaRS.OpenModel.dll
Stirrup
[OpenModelClass("CI.Services.Concrete.ReinforcedSection.OneStirrup,CI.ReinforcedSection")]
public class Stirrup : OpenObject
Inheritance
object
OpenObject
Stirrup
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Stirrup()
Constructor
public Stirrup()
Properties
 AnchorageLenght
Anchorage Lenght
public double AnchorageLenght { get; set; }
Property Value
double
 Diameter
Diameter
public double Diameter { get; set; }
Property Value
double
 DiameterOfMandrel
Radius of stirrup mandrel - refering to stirrup axis
public double DiameterOfMandrel { get; set; }
Property Value
double
 Distance
Longitudinal distance between stirrups
public double Distance { get; set; }
Property Value
double
 Geometry
Geometry
public PolyLine2D Geometry { get; set; }
Property Value
PolyLine2D
 IsClosed
Open / Closed stirrup
public bool IsClosed { get; set; }
Property Value
bool
 Material
Material
public ReferenceElement Material { get; set; }
Property Value
ReferenceElement
 ShearCheck
Status of shear check, not possible for detailing stirrup
public bool ShearCheck { get; set; }
Property Value
bool
 TorsionCheck
Status of torsion check, not possible for detailing stirrup
public bool TorsionCheck { get; set; }
Property Value
bool
 Edit this page